Autodesk.Revit.DB.CurtainGridAlignType
An enumerated to list CurtainGrid patterns.

Autodesk.Revit.DB.CurtainGridAlignType.End
End pattern of CurtainGrid.

Autodesk.Revit.DB.CurtainGridAlignType.Center
Center pattern of CurtainGrid.

Autodesk.Revit.DB.CurtainGridAlignType.Beginning
Beginning pattern of CurtainGrid.

Autodesk.Revit.DB.CurtainGridAlignType.NoJustify
NoJustify.